{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "th", "name": "convolution2d_1", "nb_filter": 32, "trainable": true, "border_mode": "valid", "activation": "linear", "input_dtype": "float32", "bias": true, "batch_input_shape": [null, 1, 60, 160], "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_filter": 64, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "th", "name": "convolution2d_2", "subsample": [1, 1], "trainable": true, "border_mode": "valid", "activation": "linear", "bias": true, "nb_row": 3, "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_filter": 64, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "th", "name": "convolution2d_3", "subsample": [1, 1], "trainable": true, "border_mode": "valid", "activation": "linear", "bias": true, "nb_row": 3, "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.25, "name": "dropout_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "output_dim": 512, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "name": "dense_1", "activation": "linear", "bias": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.25, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "output_dim": 40, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "name": "dense_2", "activation": "linear", "bias": true, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "softmax"}}]}