{"keras_version": "1.1.1", "config": [{"config": {"activity_regularizer": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "input_dtype": "float32", "init": "glorot_uniform", "name": "convolution2d_1", "nb_row": 3, "batch_input_shape": [null, 1, 60, 160], "W_constraint": null, "bias": true, "b_constraint": null, "nb_filter": 32, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "trainable": true, "name": "convolution2d_2", "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_constraint": null, "nb_filter": 64, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "dim_ordering": "th", "b_regularizer": null, "activation": "linear", "trainable": true, "name": "convolution2d_3", "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_constraint": null, "nb_filter": 64, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_3", "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_constraint": null, "output_dim": 512, "input_dim": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_constraint": null, "output_dim": 180, "input_dim": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}